namespace MathGame.Views
{
    using System.Windows.Controls;
    public partial class RulesView : Page
    {

        private readonly string hangmanRules = "Опитай се да познаеш коя дума се крие там, която често е използвана в сериала \"Островът на Сините птици\". " +
            "Направи предложение за дадена буква. Ако буквата се съдържа в думата, тя ще се покаже на всички места. " +
            "Ако в думата няма такава буква, на бесилката се рисува част от тялото на човече. При всяка грешка се рисува дадена част, докато то се нарисува изцяло, играта приключва със загуба за играча, той е „обесен“. " +
            "От друга страна, ако играчът успее да отгатне думата преди да бъде обесен, е победител.";
        private readonly string memoryRules = "Преди началото на играта снимки от сериала \"Островът на Сините птици\" се разбъркват. А после се подреждат така, че изображенията им да не се виждат. " +
            "След това играчът избира 2 снимки и ги обръща. Ако те са еднакви, печели точки и снимките остават отворени. " +
            "Ако, обаче, се различават една от друга, снимките отново се обръщат с гръбчето. Целта на играта е да се съберат всички двойки снимки с възможно най-малък брой обръщания.";
        private readonly string quizRules = "Отговори на въпросите, свързани със сериала \"Островът на Сините птици\". Това са 10 въпроса с по 2 възможни отговора, за всеки правилен отговор, играчът ще получи точки, а за грешен - ще му се отнемат.";

        public RulesView()
        {
            InitializeComponent();
            //var name = this.WindowTitle;
            //if (this.DataContext.Equals(nameof(HangmanGameView)))
            //{
            //    Rules.Text = hangmanRules;
            //}
            //else if (this.DataContext.Equals(nameof(MemoryGameView)))
            //{
            //    Rules.Text = memoryRules;
            //}
            //else if (this.DataContext.Equals(nameof(QuizGameView)))
            //{
            //    Rules.Text = quizRules;
            //}
        }


    }
}
