namespace MathGame.Views
{
    using System.Windows.Controls;
    public partial class RulesView
    {

        private readonly string hangman = "Опитай се да познаеш дума, която е често използвана в сериала \"Островът на Сините птици\". " +
            "Направи предложение за дадена буква. Ако буквата се съдържа в думата, тя ще се покаже на всички места. " +
            "Ако в думата няма такава буква, на бесилката се рисува част от тялото на човече. При всяка грешка се рисува дадена част, докато то се нарисува изцяло, играта приключва със загуба за играча, той е „обесен“. " +
            "От друга страна, ако играчът успее да отгатне думата преди да бъде обесен, е победител.";
        private readonly string memory = "Преди началото на играта снимки от сериала \"Островът на Сините птици\" се разбъркват. А после се подреждат така, че изображенията им да не се виждат. " +
            "След това играчът избира 2 снимки и ги обръща. Ако те са еднакви, печели точки и снимките остават отворени. " +
            "Ако, обаче, се различават една от друга, снимките отново се обръщат с гръбчето. Целта на играта е да се съберат всички двойки снимки с възможно най-малък брой обръщания.";
        private readonly string quiz = "Отговори на въпросите, свързани със сериала \"Островът на Сините птици\". Това са 10 въпроса с по 2 възможни отговора, за всеки правилен отговор, играчът ще получи точки, а за грешен - ще му се отнемат.";

        public RulesView(string gameName)
        {
            InitializeComponent();

            if (gameName.ToLower().Contains(nameof(hangman)))
            {
                Rules.Text = hangman;
            }
            else if (gameName.ToLower().Contains(nameof(quiz)))
            {
                Rules.Text = quiz;
            }
            else if (gameName.ToLower().Contains(nameof(memory)))
            {
                Rules.Text = memory;
            }
        }


    }
}
