using System;
using System.Collections.Generic;
using System.Text;

namespace MathGame.Data
{
    public class QuizQuestion : BaseModel
    {
        public string[,] qaData =
        {
            {"Как се казва Островът от сериала?", "Пиратският остров", "Островът на сините птици", "Островът на сините птици", String.Empty},
            {"Кои са децата, които достигат Острова?", "Ники, Алекс, Габи и Мани", "Ники, Алекс, Габи, Мани и Зоица", "Ники, Алекс, Габи и Мани", String.Empty},
            {"Как се казват героите, които са се грижели за птиците на Острова?", "Ники и Алекс", "Антоан и Алекс", "Антоан и Алекс", String.Empty},
            {"Какво ще стане, според легендата, ако намериш перо от Синя птица?", "Ще станеш богат", "Ще се научиш да летиш", "Ще се научиш да летиш", String.Empty},
            {"Защо сините птици са избягали на Острова?", "Заради бунгалата", "Заради вятърните турбини", "Заради вятърните турбини", String.Empty},
            {"Как се казва пиратът?", "Жерминяк", "Алекс", "Жерминяк", String.Empty},
            {"Как се казва книгата, по която е създаден сериала?", "Островът", "Сини птици", "Островът", String.Empty},
            {"Какво взе от всички майката(Иглика) в началото на ваканцията?", "Телефоните", "Парите", "Телефоните", String.Empty},
            {"На кое място завършва състезанието отборът на Сините птици?", "Първо", "Последно", "Последно", String.Empty},
            {"С какво стигат до Острова Ники и Габи?", "Лодка", "Парапланер", "Парапланер", String.Empty},
        };

        public string Question { get; set; }
        public string Answer1 { get; set; }
        public string Answer2 { get; set; }
        public string CorrectAnswer { get; set; }
    }
}
